[
  {
    "id": 1,
    "img": "org.png",
    "label": "Jotno Admin Panel(Org)",
    "category": "Professional Work",
    "description": "Jotno Admin Panel is a centralized organizational dashboard designed for managing multiple operational aspects of the Jotno ecosystem. It includes features like user management, prescriber onboarding, role-based access control, bulk uploads, and invoice generation. The interface adheres to strict UI/UX fidelity and ensures seamless navigation for administrative workflows.",
    "technologies": [
      "Angular",
      "PrimeNG",
      "Bootstrap",
      "REST API",
      "Typescript"
    ]
  },
  {
    "id": 2,
    "img": "doctor.png",
    "label": "Jotno Doctor Web",
    "category": "Professional Work",
    "description": "The Doctor Web app facilitates appointment scheduling, prescription issuance, and profile management for healthcare professionals. It integrates live geolocation tracking and telemedicine capabilities while ensuring responsive UI across devices. The application supports secure login, streamlined session handling, and advanced patient-doctor interaction features.",
    "technologies": [
      "Angular",
      "PrimeNG",
      "RxJS",
      "Bootstrap",
      "ReCaptcha"
    ]
  },
  {
    "id": 3,
    "img": "agrovet.png",
    "label": "Agrovet",
    "category": "Professional Work",
    "description": "Agrovet is a veterinary pharmaceutical management platform that handles distributor-level inventory, sales tracking, and KPI-based reporting. It supports dynamic SKU allocation, APR actualization, and backchannel data access for business users. The solution is scalable and built with robust component design in Angular, tightly coupled with PrimeNG UI components.",
    "technologies": [
      "Angular",
      "Node.js",
      "REST API",
      "PrimeNG",
      "Google Maps API",
      "Live Location",
      "ReCaptcha"
    ]
  },
  {
    "id": 4,
    "img": "edcr.png",
    "label": "EDCR (Electronic Daily Call Report)",
    "category": "Professional Work",
    "description": "EDCR is a renovated internal system developed for Square Pharmaceuticals, supporting medical representatives in their daily operations. The platform streamlines territory and role management, customer visit logging, and activity tracking. It includes modules for tour planning, work planning, DICOR data handling, expense and bill management, and centralized reporting. The application enhances operational efficiency and ensures compliance with organizational workflows.",
    "technologies": [
      "Angular",
      "PrimeNG",
      "Tailwind CSS",
      "Spring Boot"
    ]
  },
  {
    "id": 5,
    "img": "mrs.png",
    "label": "MRS",
    "category": "Professional Work",
    "description": "MRS is a medical representative scheduling and reporting tool that helps align field visits with sales targets. It includes automated scheduling, visit logging, and summary dashboards. The project simplifies field operations and ensures accountability through structured activity tracking.",
    "technologies": [
      "Angular",
      "PrimeNG",
      "Tailwind CSS",
      "Spring Boot",
      "Node.js"
    ]
  },
  {
    "id": 6,
    "img": "auth.png",
    "label": "Central Admin Panel",
    "category": "Professional Work",
    "description": "The Central Admin Panel unifies multiple internal tools under a single administrative dashboard for all the existing health-tech projects. It features role-based management, user impersonation, audit logs, and modular integration with different service platforms. The panel was designed to reduce administrative overhead and improve platform governance.",
    "technologies": [
      "Angular",
      "Tailwind",
      "PrimeNG",
      "REST API"
    ]
  },
  {
    "id": 7,
    "img": "mullar.png",
    "label": "Mullar Tex Ltd.",
    "category": "Freelance",
    "description": "This freelance project involved developing a responsive company website for a textile manufacturer. The site includes a catalog, inquiry form, and content management interface for easy product updates. Focus was given to clean UI and mobile-first design principles.",
    "technologies": [
      "Angular",
      "PrimeNG",
      "Bootstrap",
      "Laravel",
      "MySQL"
    ]
  },
  {
    "id": 9,
    "img": "grip.png",
    "label": "Product Logos (The Hair Gel)",
    "category": "Freelance",
    "description": "Designed a set of product logos for a personal care line as part of a freelance engagement. The focus was on creating a clean and market-aligned visual identity using Illustrator, Photoshop, and Canva.",
    "technologies": [
      "Canva",
      "Illustrator",
      "Photoshop"
    ]
  },
  {
    "id": 10,
    "img": "careinvoice.png",
    "label": "CareInvoice",
    "category": "Personal Projects",
    "description": "CareInvoice is a self-initiated SaaS project that automates invoice generation for hospitals, clinics and healthcare startups. It supports Stripe-based payments, client management, appointments and email-based invoice dispatch. The UI was designed with simplicity in mind, using SpringBoot for backend support.",
    "technologies": [
      "Angular",
      "Bootstrap",
      "Spring Boot"
    ]
  },
  {
    "id": 11,
    "img": "clique.png",
    "label": "Clique",
    "category": "Personal Projects",
    "description": "Clique is a frontend clone inspired by Reddit, built to simulate core features such as post feeds, upvoting, threaded comments, and category-based content grouping. The project focuses on content hierarchy, responsive layout, and interactive UI patterns typical of social discussion platforms.",
    "technologies": [
      "React",
      "Node.js",
      "Express",
      "MongoDB"
    ]
  },
  {
    "id": 12,
    "img": "cassette.png",
    "label": "Cassette",
    "category": "Personal Projects",
    "description": "Cassette is a podcast website prototype inspired by the Criminal podcast platform. It features episode-based browsing, audio playback integration, and a clean, focused design for content-driven storytelling. Built using the MERN stack, it includes basic content management and user authentication capabilities.",
    "technologies": [
      "HTML",
      "CSS",
      "Firebase"
    ]
  },
  {
    "id": 13,
    "img": "chalkboard.png",
    "label": "Chalkboard",
    "category": "Personal Projects",
    "description": "Chalkboard is a role-based Android application designed to support both teachers and tutors in managing their academic activities. Users can register as a teacher, tutor, or both, and access personalized dashboards featuring classroom organization, note management, scheduling, and career tracking. Tutors have access to a dedicated community feed for posting and discovering tutoring opportunities, including location, rates, and availability. The platform also includes an integrated one-to-one chat system to facilitate direct communication between users. The app is backed by Firebase for authentication, data storage, and real-time messaging.",
    "technologies": [
      "Android Studio",
      "Java",
      "Firebase"
    ]
  }
]
